dragonman225/stm32f469-usbaudio/Middlewares/ST/STM32_USB_Device_Library/Class/AUDIO/Src/usbd_audio.c
    /* Calculate remaining writable buffer size */
    if (haudio->rd_ptr < haudio->wr_ptr) {
      audio_buf_writable_size = haudio->rd_ptr + AUDIO_TOTAL_BUF_SIZE - haudio->wr_ptr;
    } else {
      audio_buf_writable_size = haudio->rd_ptr - haudio->wr_ptr;
    }

    /* Monitor remaining writable buffer size with LED */
    if (audio_buf_writable_size < AUDIO_BUF_SAFEZONE) {
      BSP_LED_On(LED2);
    } else {
      BSP_LED_Off(LED2);
    }

    /* Calculate feedback value based on the change of writable buffer size */
    int32_t audio_buf_writable_size_change;
    audio_buf_writable_size_change = audio_buf_writable_size - audio_buf_writable_size_last;
    fb_raw += audio_buf_writable_size_change * 0x1000;
    fb_value = (uint32_t)fb_raw;

    /* Update last writable buffer size */
    audio_buf_writable_size_last = audio_buf_writable_size;

    /* Check feedback max / min */
    if (fb_value > fb_nom + fb_delta) {
      fb_value = fb_raw = fb_nom + fb_delta;
    } else if (fb_value < fb_nom - fb_delta) {
      fb_value = fb_raw = fb_nom - fb_delta;
    }

    /* Transmit feedback only when the last one is transmitted */
    if (tx_flag == 0U) {
      /* Get FNSOF, use volatile since its address is mapped to a hardware register. */
      // USB_OTG_GlobalTypeDef* USBx = USB_OTG_FS;
      // uint32_t USBx_BASE = (uint32_t)USBx;
      // uint32_t volatile fnsof_new = (USBx_DEVICE->DSTS & USB_OTG_DSTS_FNSOF) >> 8;

      uint8_t fb_data[3] = {(fb_value & 0x0000FF00) >> 8, (fb_value & 0x00FF0000) >> 16, (fb_value & 0xFF000000) >> 24};

      //if ((fnsof & 0x1) == (fnsof_new & 0x1)) {
      if (1) {
        USBD_LL_Transmit(pdev, AUDIO_IN_EP, fb_data, 3U);
        /* Block transmission until it's finished. */
        tx_flag = 1U;
      }
    }
  }

  return USBD_OK;
}

/**
  * @brief  USBD_AUDIO_SOF
  *         handle SOF event
  * @param  pdev: device instance
  * @retval status
  */
void USBD_AUDIO_Sync(USBD_HandleTypeDef* pdev, AUDIO_OffsetTypeDef offset)
{
  // uint32_t cmd = 0U;
  // USBD_AUDIO_HandleTypeDef* haudio;
  // haudio = (USBD_AUDIO_HandleTypeDef*)pdev->pClassData;

  // haudio->offset = offset;

  // if (haudio->rd_enable == 1U) {
  //   haudio->rd_ptr += (uint16_t)(AUDIO_TOTAL_BUF_SIZE / 2U);

  //   if (haudio->rd_ptr == AUDIO_TOTAL_BUF_SIZE) {
  //     /* roll back */
  //     haudio->rd_ptr = 0U;
  //   }
  // }

  // if (haudio->rd_ptr > haudio->wr_ptr) {
  //   if ((haudio->rd_ptr - haudio->wr_ptr) < AUDIO_OUT_PACKET) {
  //     cmd = AUDIO_TOTAL_BUF_SIZE / 2U + 4U;
  //   } else {
  //     if ((haudio->rd_ptr - haudio->wr_ptr) > (AUDIO_TOTAL_BUF_SIZE - AUDIO_OUT_PACKET)) {
  //       cmd = AUDIO_TOTAL_BUF_SIZE / 2U - 4U;
  //     }
  //   }
  // } else {
  //   if ((haudio->wr_ptr - haudio->rd_ptr) < AUDIO_OUT_PACKET) {
  //     cmd = AUDIO_TOTAL_BUF_SIZE / 2U - 4U;
  //   } else {
  //     if ((haudio->wr_ptr - haudio->rd_ptr) > (AUDIO_TOTAL_BUF_SIZE - AUDIO_OUT_PACKET)) {
  //       cmd = AUDIO_TOTAL_BUF_SIZE / 2U + 4U;
  //     }
  //   }
  // }

  // if (haudio->offset == AUDIO_OFFSET_FULL) {
  //   ((USBD_AUDIO_ItfTypeDef*)pdev->pUserData)->AudioCmd(&haudio->buffer[0], cmd, AUDIO_CMD_PLAY);
  //   haudio->offset = AUDIO_OFFSET_NONE;
  // }
}

/**
 * !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
 * USBD_AUDIO_IsoINIncomplete & USBD_AUDIO_IsoOutIncomplete are not 
 * enabled by default.
 * 
 * Go to Middlewares/ST/STM32_USB_Device_Library/Core/Src/usbd_core.c
 * Fill in USBD_LL_IsoINIncomplete and USBD_LL_IsoOUTIncomplete with 
 * actual handler functions.
 * !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
 */

/**
  * @brief  USBD_AUDIO_IsoINIncomplete
  *         handle data ISO IN Incomplete event
  * @param  pdev: device instance
  * @param  epnum: endpoint index
  * @retval status
  */
static uint8_t USBD_AUDIO_IsoINIncomplete(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
  // USB_OTG_GlobalTypeDef* USBx = USB_OTG_FS;
  // uint32_t USBx_BASE = (uint32_t)USBx;
  // fnsof = (USBx_DEVICE->DSTS & USB_OTG_DSTS_FNSOF) >> 8;

  if (tx_flag == 1U) {
    tx_flag = 0U;
    USBD_LL_FlushEP(pdev, AUDIO_IN_EP);
  }

  return USBD_OK;
}

/**
  * @brief  USBD_AUDIO_IsoOutIncomplete
  *         handle data ISO OUT Incomplete event
  * @param  pdev: device instance
  * @param  epnum: endpoint index
  * @retval status
  */
static uint8_t USBD_AUDIO_IsoOutIncomplete(USBD_HandleTypeDef* pdev, uint8_t epnum)
{
  return USBD_OK;
}

/**
  * @brief  USBD_AUDIO_DataOut
  *         handle data OUT Stage
  * @param  pdev: device instance
  * @param  epnum: endpoint index
  * @retval status
  */
static uint8_t USBD_AUDIO_DataOut(USBD_HandleTypeDef* pdev,
                                  uint8_t epnum)
{
  USBD_AUDIO_HandleTypeDef* haudio;
  haudio = (USBD_AUDIO_HandleTypeDef*)pdev->pClassData;

  static uint8_t tmpbuf[1024];

  if (epnum == AUDIO_OUT_EP) {
    uint32_t curr_length = USBD_GetRxCount(pdev, epnum);
    uint32_t curr_pos = haudio->wr_ptr;
    uint32_t rest = AUDIO_TOTAL_BUF_SIZE - curr_pos;

    /* Ignore strangely large packets */
    if (curr_length > AUDIO_OUT_PACKET) {
      curr_length = 0U;
    }

    /* Update circular audio buffer */
    if (rest < curr_length) {
      if (rest > 0U) {
        memcpy(&haudio->buffer[curr_pos], tmpbuf, rest);
        curr_length -= rest;
      }
      if (curr_length > 0U) {
        memcpy(&haudio->buffer[0], &tmpbuf[rest], curr_length);
        haudio->wr_ptr = curr_length;
      }
    } else {
      if (curr_length > 0U) {
        memcpy(&haudio->buffer[curr_pos], tmpbuf, curr_length);
        haudio->wr_ptr += curr_length;
      }
    }

    /* Start playing when half of the audio buffer is filled */
    if (haudio->wr_ptr >= AUDIO_TOTAL_BUF_SIZE / 2U) {
      if (haudio->offset == AUDIO_OFFSET_UNKNOWN && is_playing == 0U) {
        is_playing = 1U;

        ((USBD_AUDIO_ItfTypeDef*)pdev->pUserData)->AudioCmd(&haudio->buffer[0], AUDIO_TOTAL_BUF_SIZE / 2U, AUDIO_CMD_START);
        haudio->offset = AUDIO_OFFSET_NONE;

        if (haudio->rd_enable == 0U) {
          haudio->rd_enable = 1U;
        }
      }
    }

    /* Rollback if reach end of buffer */
    if (haudio->wr_ptr >= AUDIO_TOTAL_BUF_SIZE) {
      haudio->wr_ptr = 0U;
    }

    USBD_LL_PrepareReceive(pdev, AUDIO_OUT_EP, tmpbuf, AUDIO_OUT_PACKET);

    /* Increment the Buffer pointer or roll it back when all buffers are full */

    // haudio->wr_ptr += AUDIO_OUT_PACKET;

